import re

def is_url(text):
    url_pattern = re.compile(r'http[s]?://(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\\(\\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+')
    return bool(url_pattern.match(text))

category_map = {
    "doc1": "Базовые документы",
    "doc2": "Структура ППО",
    "doc3": "Правовая защита",
    "doc4": "Охрана труда",
    "doc5": "Оздоровление",
    "doc6": "Туристско-экскурсионная деятельность",
    "doc7": "Информационная работа",
    "doc8": "Объявления",
    "doc9": "Образцы документов",
    "doc10": "Полезные ссылки"
}